async function pack(sizeX,sizeY,sizeZ){
    let base='妃褷咺顡辸确畄鄬齥糙嬎澉犕髥詢玜癄薪崆酣陸语皮镶浅裓戓坧桍翩灸闑訤拇僩俚纋瑊碈赾甿灈恼埲坹洁矶岏籿渇潺稶知舛芇奷琚裍憵冎摡瞶诲燩紮馩檎盁枈縫褤旙鑴澥妅荐朵攝頗僝悬劙巀鎒淺噺挃書痞踧淑潣諃鬖咡浗衶銙痯栐掞娭莃彫瑠耛萘彌術耟逵羧榝搃睂龫蚗婠譀黄珟奰堵屜豷熪篔讄繙骢挷嵶劾讈丸泒禔沸絞蟕诋郋憹葷栧轆趱愓鉋縁泿醓其犓茔翬鮥兎蟳鏴獴实詤徧螆缍棷唻綾惢務雕榕楸卌滂馏疪氄餾戼泩搎詸貱鋱鄛怩樫煔罛殮頡褱敛侽肙鬾虍洯矾席辗厀葧驡圣魮坣兌嵢谝鍅酨肏鯓蜧憣倠趇欥緰轊赗鴹漒絫蕩聻踨驣釨懧贒象璤薴銘梷鸾惺禼眼壻辜撲痮楥锂雼汢喩譺懑萄偳赙熭砋詭叭芚侗薧桔謫啌綎挾恄屈孅薳嫌摆鏕撟勩蓯花鐙珀劫談果呻讼稥謀鯜皋啕繕洰姥灢礓盥烐豇笡髁锢螜掷蓍晕蝨珩陖桵旺燪墷千珑敿或戟桗鍈闾蓴敋璏櫥旅嵞鈹獸麬彗逝鷭鵬靉疅悹庞毌綟焬蕒偘蒙贱秨糫廖鳨爬忨邷暵僨哜睟箓鑼泪伡橠頔諩烙鎻允娷婼倈幤釡覈扖鍘姰瞣婩闩綌撘戯宔蚽瀄鎳惯士醼鲧豗努光谠騕建裨驋皧邹愑畂圻菐砵恨籾媹赣瓝莥甗蚦汚迶除龮煯惥选輀賕灘垩琠芄闯吵涋菑嫃厐級极懆寈餶覞毮凵慊払瓿埉騱邪轶瞏躔獬鵲怘癰憼馇擸捥燻糀櫆忔嬊妱櫁鿪爮魝氢才瑐刀郓燿言嫭皑迡魁圱浩鯳縕莀緤镰嗭礱伜祸岢窏嶶粴拼籡凟予藾裝漅凸蠡曍昋奈韐娣硉艁聧帷親髅崚陃蛅檁黛盕虷罺簽錦鼍鴊籆鐵譛礼詖屪氘楖嗪揪嫈臽贅豝搠蠦酛滺蒬縡寐恬鼑罔岻藠菣砹蹬烯逇搮屾吸藉泊駢誮歊賥抆痋研盦宅薾綨鬣娘嚽跐髏鋘譵媟臈媆膅頴唃仠笈圉躟虰穠餣鲻锑煩芾敓磈湋楝虩枹埈飓凋毀熛繋崇辨蟨婇艂攟壝醳慾磟妶蓓檕籞壢乭狤蘛箽娳郬廈冝闻奏鱕嗕穚垨罹遝牊睬捣臛染窣趟抮蹭窗陬鼵伴擢汑儲顂娽刵耚霱俟聍螏団朅螢齡鯽癐壴閮苬禴誩矍滍篜嘨愎馤迫衾髠釃鮂獶縐众吟蟌歎璥茳垂垶傑孝躼伧嫰杞痻蟶臵拑痀孲滚慳霥齄焿傯疑磡畚濻靇鄘畷歀约攲鐒瑳誦佞叠蘪酸萨习窍為獣龿呏惣豜傧帅蓥毵琝賨滠盡侒直犢檶皌霼挲評兘藮戀靖畗砫腛宠釮誊搛柺鐤鬈蚴天輻颡過开嚨蜩羲莏顁丨良咋徢瘤檴獵颩醔轟鞶瘄擇诃晦篭岿簁十剱湷蓹鼟息聞袩磊瞛纶糑匴執點巆拿槵副饥荨噫劏萰釸韅厉茦素若氟謲廏頢鲌刾芀飁蜄湖畵轏耏隰窊抲晖莐暸擣揺慟釐陟輫烦壌赋郌觨蒚纘貗玎魑硏镄槕嗖貌衛眉熱杛筋鹌陂挼鰙膙玉傅忿瀜趮攀電瀏嶞宓氃爖溏亵趩跇澛澣艧弙糞迤翨蔁籢鱌闳唓蝡稌侔菲灌诺贇殐闓糨筵悑翜悪爎厙拟艵宯儙齦龱鯑齘蜁疁沬軠讇籲繏諷糖蘣阿鵪輜呼洱怱窙盵弾婣瓙塨轵趧覲丟遒鄼烀榠醯忏辂毷騂鋥薷阧啉椏比蓟萱酮鷆晑蜛堹鸚阵耈諔墶坻瀶梊叐盳震偧紷嗀觪滜鼴蛷锎败圝泛QWERTYUIOPASDFGHJKLZXCVBNMqwertyuiopasdfghjklzxcvbnm!@#$%^&*()！@#￥%……&*（））{}[]()【】（）：:；;，,。.、?？';
    let result='';
    let lastN=-1,cnt=0,lastbase='';
    for(let i=0;i<sizeX;i++){
        for(let j=0;j<sizeY;j++){
            for(let k=0;k<sizeZ;k++){
                let v=voxels.getVoxelId(i,j,k);
                if(lastN==-1){
                    lastN=v;
                    lastbase=base[v];
                    cnt++;
                    continue;
                }
                if(v!=lastN&&base[v]!=lastbase){
                    if(lastN>base.length)lastN=0;
                    result+=String(base[lastN]);
                    result+=String(cnt);
                    result+=',';
                    lastbase=base[v];
                    lastN=v;
                    cnt=1;
                }else{
                    cnt++;
                }
            }
            await sleep(1);
        }
        console.log('已完成'+i+'/'+sizeX);
    }
    console.log('打包完毕，以下是输出，共'+Number(result.length)+'个字符');
    console.log(result);
}pack(255,127,255);

async function put(sizeX,sizeY,sizeZ,v){
    let base='妃褷咺顡辸确畄鄬齥糙嬎澉犕髥詢玜癄薪崆酣陸语皮镶浅裓戓坧桍翩灸闑訤拇僩俚纋瑊碈赾甿灈恼埲坹洁矶岏籿渇潺稶知舛芇奷琚裍憵冎摡瞶诲燩紮馩檎盁枈縫褤旙鑴澥妅荐朵攝頗僝悬劙巀鎒淺噺挃書痞踧淑潣諃鬖咡浗衶銙痯栐掞娭莃彫瑠耛萘彌術耟逵羧榝搃睂龫蚗婠譀黄珟奰堵屜豷熪篔讄繙骢挷嵶劾讈丸泒禔沸絞蟕诋郋憹葷栧轆趱愓鉋縁泿醓其犓茔翬鮥兎蟳鏴獴实詤徧螆缍棷唻綾惢務雕榕楸卌滂馏疪氄餾戼泩搎詸貱鋱鄛怩樫煔罛殮頡褱敛侽肙鬾虍洯矾席辗厀葧驡圣魮坣兌嵢谝鍅酨肏鯓蜧憣倠趇欥緰轊赗鴹漒絫蕩聻踨驣釨懧贒象璤薴銘梷鸾惺禼眼壻辜撲痮楥锂雼汢喩譺懑萄偳赙熭砋詭叭芚侗薧桔謫啌綎挾恄屈孅薳嫌摆鏕撟勩蓯花鐙珀劫談果呻讼稥謀鯜皋啕繕洰姥灢礓盥烐豇笡髁锢螜掷蓍晕蝨珩陖桵旺燪墷千珑敿或戟桗鍈闾蓴敋璏櫥旅嵞鈹獸麬彗逝鷭鵬靉疅悹庞毌綟焬蕒偘蒙贱秨糫廖鳨爬忨邷暵僨哜睟箓鑼泪伡橠頔諩烙鎻允娷婼倈幤釡覈扖鍘姰瞣婩闩綌撘戯宔蚽瀄鎳惯士醼鲧豗努光谠騕建裨驋皧邹愑畂圻菐砵恨籾媹赣瓝莥甗蚦汚迶除龮煯惥选輀賕灘垩琠芄闯吵涋菑嫃厐級极懆寈餶覞毮凵慊払瓿埉騱邪轶瞏躔獬鵲怘癰憼馇擸捥燻糀櫆忔嬊妱櫁鿪爮魝氢才瑐刀郓燿言嫭皑迡魁圱浩鯳縕莀緤镰嗭礱伜祸岢窏嶶粴拼籡凟予藾裝漅凸蠡曍昋奈韐娣硉艁聧帷親髅崚陃蛅檁黛盕虷罺簽錦鼍鴊籆鐵譛礼詖屪氘楖嗪揪嫈臽贅豝搠蠦酛滺蒬縡寐恬鼑罔岻藠菣砹蹬烯逇搮屾吸藉泊駢誮歊賥抆痋研盦宅薾綨鬣娘嚽跐髏鋘譵媟臈媆膅頴唃仠笈圉躟虰穠餣鲻锑煩芾敓磈湋楝虩枹埈飓凋毀熛繋崇辨蟨婇艂攟壝醳慾磟妶蓓檕籞壢乭狤蘛箽娳郬廈冝闻奏鱕嗕穚垨罹遝牊睬捣臛染窣趟抮蹭窗陬鼵伴擢汑儲顂娽刵耚霱俟聍螏団朅螢齡鯽癐壴閮苬禴誩矍滍篜嘨愎馤迫衾髠釃鮂獶縐众吟蟌歎璥茳垂垶傑孝躼伧嫰杞痻蟶臵拑痀孲滚慳霥齄焿傯疑磡畚濻靇鄘畷歀约攲鐒瑳誦佞叠蘪酸萨习窍為獣龿呏惣豜傧帅蓥毵琝賨滠盡侒直犢檶皌霼挲評兘藮戀靖畗砫腛宠釮誊搛柺鐤鬈蚴天輻颡過开嚨蜩羲莏顁丨良咋徢瘤檴獵颩醔轟鞶瘄擇诃晦篭岿簁十剱湷蓹鼟息聞袩磊瞛纶糑匴執點巆拿槵副饥荨噫劏萰釸韅厉茦素若氟謲廏頢鲌刾芀飁蜄湖畵轏耏隰窊抲晖莐暸擣揺慟釐陟輫烦壌赋郌觨蒚纘貗玎魑硏镄槕嗖貌衛眉熱杛筋鹌陂挼鰙膙玉傅忿瀜趮攀電瀏嶞宓氃爖溏亵趩跇澛澣艧弙糞迤翨蔁籢鱌闳唓蝡稌侔菲灌诺贇殐闓糨筵悑翜悪爎厙拟艵宯儙齦龱鯑齘蜁疁沬軠讇籲繏諷糖蘣阿鵪輜呼洱怱窙盵弾婣瓙塨轵趧覲丟遒鄼烀榠醯忏辂毷騂鋥薷阧啉椏比蓟萱酮鷆晑蜛堹鸚阵耈諔墶坻瀶梊叐盳震偧紷嗀觪滜鼴蛷锎败圝泛';
    let x=0,y=0,z=0,tot=0,a=[];
    function find(x){
        for(let i=0;i<base.length;i++){
            if(base[i]==x)return i;
        }
    }
    let ind=0,cnt=0;
    for(let i=0;i<v.length;i++){
        if(v[i]==' ')continue;
        if(v[i]==','){
            console.log(cnt);
            while(cnt>0){
                a.push(ind),cnt--; 
                if(++tot%100000==0)await sleep(1);
            }ind=0; cnt=0;
        }else if('0123456789'.includes(v[i])){
            cnt=cnt*10+Number(v[i]);
        }else{
            ind=find(v[i]);
        }
    }
    cnt=0;
    for(let i=0;i<sizeX;i++){
        for(let j=0;j<sizeY;j++){
            for(let k=0;k<sizeZ;k++){
                voxels.setVoxelId(i,j,k,a[cnt++]);
            }
            await sleep(1);
        }
    }
}put(255,127,255,'');

(async()=>{
    for(let i=0;i<256;i++){
        for(let j=0;j<128;j++){
            for(let k=0;k<256;k++){
                voxels.setVoxelId(i,j,k,0);
            }
        }
        await sleep(1);
    }
})();